<template>
  <div class="home">
    <img alt="Vue logo" src="../assets/logo.png" />
    <h1>
      Комментарии по коду/реализации
    </h1>
    <div>
      <h2>
        Общее
      </h2>
      <div>
        <h4>
          Ипользуемые ресурсы/библиотеки
        </h4>
        SASS, prettier. Остальное - нативно/через vuejs
      </div>
      <div>
        <h4>
          Почему именно такие настройки prettier?
        </h4>
        Привычка. Переучиться на новое будет совсем не сложно, но такие настройки были на прошлых проектах
      </div>
      <div>
        <h4>
          Почему бы не подключить %libraryName%?
        </h4>
        Было очень интересно сделать рабочий стол максимально нативно. А в сокетах нет ничего сложного, для чего
        подключение чего-либо было бы выгодным
      </div>
      <div>
        <h4>
          Почему так некрасиво?
        </h4>
        Функционально! Про красоту требований не было, поэтому прототип делался максимально функционально. При это
        удобство пользования всё же не забывалось (всё же тестить сами будем, о себе позаботиться тоже надо ^_^)
      </div>
    </div>
    <div>
      <h2>
        Desktop
      </h2>
      <div>
        <h4>
          Метод кеширования
        </h4>
        localStorage. Эти данные не критичны для безопасности, поэтому можно и так. Если бы был бэк - можно было бы
        хранить там, чтобы синхронизировать на разных устройствах.
      </div>
      <div>
        <h4>
          Почему без vuex?
        </h4>
        Vuex всё же предпочитаю для случаев, когда надо синхронизировать данные многих компонент. Или для очень сложных
        формочек. Здесь все данные умещаются в одной и нигде больше не нужны и никогда не будут нужны.
      </div>
      <div>
        <h4>
          Зачем файл constants.js?
        </h4>
        Чтобы вынести все константы в отдельный файл и не засорять основной.
      </div>
      <div>
        <h4>
          Почему позиция окна пихается в props, а не устанавливается в родительской компоненте?
        </h4>
        Потому что может появиться в будущем идея такого окна, для которого будет важно знать свой размер. И даже если
        этого не случится - текущая реализация не дает много мусора или каких-либо ударов по производительности
      </div>
      <div>
        <h4>
          v-bind="item"?
        </h4>
        Ага. Коротко и ясно.
      </div>
      <div>
        <h4>
          Почему isMoving и isResizing - разные переменные?
        </h4>
        Так исторически сложилось. Возможно, стоило бы просто оставить одну и сделать поле-индикатор. Но у них чуть
        разная структура, поэтому поэтому не вижу определенного выигрыша в любом из вариантов
      </div>
      <div>
        <h4>
          Как можно улучшить? Что для этого сделать?
        </h4>
        <p>
          Объединить переменную стиля $resize-border-size и edgeVisualWidth в константах
        </p>
        <p>
          Предусмотреть при загрузке из кеша нормирование всех level. То есть сделать вместо текущих возможных 1, 2,
          1000, 34863 нормальные 1, 2, 3, 4. Иначе можно вылезти за предел (хотя и ОЧЕНЬ нескоро)
        </p>
        <p>
          Считать позицию окон не в абсолютных величинах при сохранении-загрузке окон. Иначе окно может оказаться за
          пределами экрана без возможности даже узнать о том, что оно там есть
        </p>
        <p>
          Можно динамически вешать/снимать listener'ы mousemove/mouseup. Но это настолько мелкие операции проверки, что
          их совсем не жалко кидать каждый tick. На рекламных лендингах намного больше навешано и ничего, работают и
          быстро.
        </p>
      </div>
    </div>
    <div>
      <h2>
        Websockets
      </h2>
      <div>
        <h4>
          Зачем отдельно делать переменную статуса?
        </h4>
        Потому что состояние websocket'а, если смотреть на него - не реактивно. Поэтому приходится дублировать и через
        callback'и менять.
      </div>
      <div>
        <h4>
          Зачем shownFields?
        </h4>
        Когда делаем таблицу, то первая же хотелка - "а давайте скрывать столбцы и сортироку добавим!". Вот сразу для
        этого.
      </div>
      <div>
        <h4>
          А почему данные транзакций храним полностью, а для вывода каждый раз форматируем?
        </h4>
        Потому что данные терять не стоит. А форматируя для вывода мы позволяем в будущем еще приделать относительно
        быстро пагинацию, фильтр, сортировку итд. Да, на большом количестве данных будет тормозирить. Тогда и приделаем
        пагинацию и всё снова станет хорошо.
      </div>
      <div>
        <h4>
          Что можно улучшить?
        </h4>
        <p>
          Сделать статус более понятным (сейчас он очень базово реализован) и выводить его
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Home',
  components: {},
};
</script>
